
### Pandas-DataFrame And Series
Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [4]:
!pip install Pandas
import pandas as pd

Collecting Pandas
  Downloading pandas-2.2.3-cp310-cp310-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.22.4 in d:\ds-project\complate-data-science-machine-learning-dl-nlp\venv\lib\site-packages (from Pandas) (2.2.4)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\ds-project\complate-data-science-machine-learning-dl-nlp\venv\lib\site-packages (from Pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from Pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from Pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in d:\ds-project\complate-data-science-machine-learning-dl-nlp\venv\lib\site-packages (from python-dateutil>=2.8.2->Pandas) (1.17.0)
Downloading pandas-2.2.3-cp310-cp310-win_amd64.whl (11.6 MB)
   ---------------------------------------- 0.0/11.6 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.6 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.6 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.6 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.6 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.6 MB ? eta -:--:--
    --------------------------------------- 0.3/11.6 MB ? eta -:--:--
   - -------------------------------------- 0.5/11.6 MB 762.0 kB/s eta 0:00:15
   -- ------------------------------------- 0.8/11.6 MB 1.0 MB/s eta 0:00:11
   ---- ----------------------------------- 1.3/11.6 MB 1.4 MB/s eta 0:00:08
   ------- -------------------------------- 2.1/11.6 MB 1.8 MB/s eta 0:00:06
   --------- ------------------------------ 2.6/11.6 MB 2.0 MB/s eta 0:00:05
   ---------- ----------------------------- 3.1/11.6 MB 2.0 MB/s eta 0:00:05
   ----------- ---------------------------- 3.4/11.6 MB 1.9 MB/s eta 0:00:05
   ------------ --------------------------- 3.7/11.6 MB 2.0 MB/s eta 0:00:05
   --------------- ------------------------ 4.5/11.6 MB 2.0 MB/s eta 0:00:04
   ------------------ --------------------- 5.5/11.6 MB 2.3 MB/s eta 0:00:03
   --------------------- ------------------ 6.3/11.6 MB 2.4 MB/s eta 0:00:03
   ------------------------ --------------- 7.1/11.6 MB 2.5 MB/s eta 0:00:02
   ---------------------------- ----------- 8.1/11.6 MB 2.7 MB/s eta 0:00:02
   ------------------------------ --------- 8.9/11.6 MB 2.8 MB/s eta 0:00:01
   ---------------------------------- ----- 10.0/11.6 MB 2.9 MB/s eta 0:00:01
   ------------------------------------- -- 11.0/11.6 MB 3.0 MB/s eta 0:00:01
   ---------------------------------------- 11.6/11.6 MB 3.0 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, Pandas
Successfully installed Pandas-2.2.3 pytz-2025.2 tzdata-2025.2

In [5]:
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
## Series
##A Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.

import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [7]:
## Create a Series from dictionary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [8]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [9]:
## Dataframe
## create a Dataframe from a dictionary oof list

data={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [10]:
## Create a Data frame From a List of Dictionaries

data=[
    {'Name':'Krish','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':34,'City':'Bangalore'},
    {'Name':'Bappy','Age':32,'City':'Bangalore'},
    {'Name':'JAck','Age':32,'City':'Bangalore'}
    
]
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore
<class 'pandas.core.frame.DataFrame'>

In [1]:
import pandas as pd
df=pd.read_csv(r'D:\DS-Project\Complate-Data-Science-Machine-Learning-DL-NLP\10-Data Analysis With Pytho\stud.csv')
df.head(5)

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [2]:
df.tail()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [3]:
### Accessing Data From Dataframe
df

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [5]:
df['lunch']

0          standard
1          standard
2          standard
3      free/reduced
4          standard
           ...
995        standard
996    free/reduced
997    free/reduced
998        standard
999    free/reduced
Name: lunch, Length: 1000, dtype: object

In [6]:
df.loc[0]

gender                                    female
race_ethnicity                           group B
parental_level_of_education    bachelor's degree
lunch                                   standard
test_preparation_course                     none
math_score                                    72
reading_score                                 72
writing_score                                 74
Name: 0, dtype: object

In [8]:
df.iloc[1]

gender                               female
race_ethnicity                      group C
parental_level_of_education    some college
lunch                              standard
test_preparation_course           completed
math_score                               69
reading_score                            90
writing_score                            88
Name: 1, dtype: object

In [9]:
## Accessing a specified element
df.at[2,'gender']

'female'

In [14]:
df.at[88,'reading_score']

np.int64(70)

In [15]:
## Accessing a specified element using iat
df.iat[2,2]

"master's degree"

In [ ]:
## Adding a column
df['Salary']=[50000,60000,70000]
df

In [17]:
## Remove a column
df.drop('race_ethnicity',axis=1,inplace=True)

In [18]:
df

,gender,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,bachelor's degree,standard,none,72,72,74
1,female,some college,standard,completed,69,90,88
2,female,master's degree,standard,none,90,95,93
3,male,associate's degree,free/reduced,none,47,57,44
4,male,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...
995,female,master's degree,standard,completed,88,99,95
996,male,high school,free/reduced,none,62,55,55
997,female,high school,free/reduced,completed,59,71,65
998,female,some college,standard,completed,68,78,77
999,female,some college,free/reduced,none,77,86,86

In [19]:
df.describe()

       math_score  reading_score  writing_score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [20]:
# Display the data types of each column
print("Data types:\n", df.dtypes)

# Describe the DataFrame
print("Statistical summary:\n", df.describe())

Data types:
 gender                         object
parental_level_of_education    object
lunch                          object
test_preparation_course        object
math_score                      int64
reading_score                   int64
writing_score                   int64
dtype: object
Statistical summary:
        math_score  reading_score  writing_score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000